import pandas as pd

# 创建CSV文件
data = {'选手姓名': ['张三', '李四', '张三', '李四','张三', '李四', '张三', '李四'],
        '比赛日期': ['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04','2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04'],
        '比赛地点': ['北京', '上海', '广州', '深圳','北京', '上海', '广州', '深圳'],
        '比赛级别': ['C', 'C', 'D', 'D','A', 'A', 'D', 'B'],
        '剑种': ['F', 'F', 'F', 'F','F', 'F', 'F', 'F'],
        '持剑手': ['L', 'L', 'L', 'L','L', 'L', 'L', 'L'],
        '单站积分': ['100', '90', '80', '150','150', '80', '-10', '100']}
df = pd.DataFrame(data)

# 添加选手年龄和选手排名
df['选手年龄'] = 14
df['选手排名'] = [1, 22, 31, 14,4, 12, 53, 4]

# 保存CSV文件
df.to_csv('data.csv', index=False)

# 加载CSV文件
data = pd.read_csv('data.csv')